{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2016 - 2019)"
      ],
      "degree": "Honours Bachelor of Science",
      "department": "Computer Science",
      "duration": "2015-2019",
      "school_name": "University of Toronto Scarborough"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_DaydeReid",
  "highlighted_projects": [
    {
      "description": "Designed and programmed an autonomous soccer robot, which used a C program alongside a proprietary library to analyze webcam footage and inform decisions in a simple finite-state AI algorithm",
      "git_url": null,
      "name": "Lego Soccer Robot"
    },
    {
      "description": "Designed and programmed a web app, with a Javascript-based front end, and a Python backend utilizing Django, that allowed for the writing and running of Python code in-browser, with multiple people able to edit the same code at the same time",
      "git_url": null,
      "name": "Collaborative Coding Web App"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a series of bash scripts that record hardware specifications and usage statistics for a Linux cluster and write them to a PSQL database contained in a Docker instance for future analysis",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Created a Twitter CLI App, which utilizes a REST API to post, view, and delete tweets from the Twitter webpage",
        "JDBC App: Implemented some DAOs for a JDBC system",
        "Grep App: Replicated the recursive grep function found in Linux systems using Java streams"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Created a stock trading simulation accessible through a REST API, featuring a three layer Microservice architecture, managed using Maven, and utilizing Spring Boot for dependency injection, testing, as well as its provided webservlet. A PSQL database is used for storing data, which is either created by the app, or, for the stock quotes, pulled from IEX Cloud. For ease of use, the entire app was dockerized, using a container to run the PSQL server and another to run the application itself.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "Evaluate different big data tools, with a focus on the Core Hadoop components MapReduce, HDFS, and YARN, through the use of a Hadoop cluster provisioned from Google Cloud Computing. Ran sample queries on the WDI dataset to test out functionality for Hadoop-based software such as Apache Hive, recording them within a Zeppelin notebook for later viewing.",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "Investigated Apache Spark as a big data evaluation tool, comparing Spark RDDs and Structured APIs in order to determine their effectiveness at manipulating data. Utilized a Google Cloud Computing Hadoop cluster to run comparison queries on the WDI dataset, recording the results in a Zeppelin notebook",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "In progress",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Dayde Reid",
  "others": [
    {
      "bullets": [
        "Video games",
        "Cycling",
        "Camping"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Implemented several projects, covering a wide variety of uses and technologies, including Java command line apps and Springboot-based REST APIs. Collaborated together with an Agile team using the Scrum framework, for which we were responsible running our own Scrum ceremonies",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "Loblaw Digital",
      "description": "Collaborated with a team to ensure optimal working conditions of an existing country-wide eCommerce site with a React and Java stack through the resolving of numerous technical issues and improvement of existing page designs",
      "duration": "2018-2018",
      "title": "Software Developer Co-op"
    },
    {
      "company": "Parks Canada",
      "description": "Developed and released a guide application for Rouge National Urban Park as both a Swift-based iOS app and a Java-based Android app, utilizing the Google Maps framework to perform GPS mapping, which has since been downloaded by over 1000 users",
      "duration": "2017-2017",
      "title": "Application Developer Co-op"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Apache Hive",
      "Hadoop",
      "Scala",
      "Apache Spark",
      "C",
      "C ++",
      "CSS",
      "React"
    ],
    "familiar": [
      "Angular",
      "Android",
      "iOS",
      "Swift",
      "Matlab",
      "Haskell",
      "Django"
    ],
    "proficient": [
      "Java",
      "Javascript",
      "Linux/Bash",
      "Springboot",
      "RDBMS/SQL",
      "HTML",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate of the University of Toronto, where I earned my Honours Bachelor of Science. I studied computer science as a specialist program, focusing on software engineering, as I prefer the more practical side of computer science. During my schooling, I managed to get some experience in the workplace, as I had two co-op job positions. The first was an 8-month term at Parks Canada, where I helped developed and release a guide app for one of their parks for both iOS and Android. The second was at Loblaw Digital, where I spent 4 months improving and maintaining one of their existing eCommerce websites. I joined the Jarvis Consulting Group a few months after graduating and began training for a Data Engineering position. Right now, I am looking for a position at a company where I can put the skills I have learned to good use, while hopefully also continuing to learn so that I might better myself further."
}
